Catalogs/ТоварныеКатегории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварныеКатегории</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДСТ_Группа1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДСТ_ГруппыТоварныхКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСТ_Группа2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДСТ_ГруппыТоварныхКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСТ_Группа3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДСТ_ГруппыТоварныхКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТоварныеКатегории/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ДСТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПолеВвода = Элементы.Добавить("ДСТ_Группа1", Тип("ПолеФормы"), ЭтаФорма);
	ПолеВвода.Заголовок = "Группа 1";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДСТ_Группа1";
	ПолеВвода.КнопкаОчистки = Истина;
	ПолеВвода.УстановитьДействие("ПриИзменении","ДСТ_ПриИзмененииГруппы");
	
	ПолеВвода = Элементы.Добавить("ДСТ_Группа2", Тип("ПолеФормы"), ЭтаФорма);
	ПолеВвода.Заголовок = "Группа 2";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДСТ_Группа2";
	ПолеВвода.КнопкаОчистки = Истина;
	ПолеВвода.УстановитьДействие("ПриИзменении","ДСТ_ПриИзмененииГруппы");
	
	ПолеВвода = Элементы.Добавить("ДСТ_Группа3", Тип("ПолеФормы"), ЭтаФорма);
	ПолеВвода.Заголовок = "Группа 3";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДСТ_Группа3";
	ПолеВвода.КнопкаОчистки = Истина;
	ПолеВвода.УстановитьДействие("ПриИзменении","ДСТ_ПриИзмененииГруппы");
	
	Элементы.Наименование.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Наименование.Ширина = 0;
	Элементы.Наименование.РастягиватьПоГоризонтали = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДСТ_ПриИзмененииГруппы(Элемент)
	
	СборноеНаименование = "";
	
	Если ЗначениеЗаполнено(Объект.ДСТ_Группа1) Тогда
		СборноеНаименование = СборноеНаименование + " / " + Объект.ДСТ_Группа1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДСТ_Группа2) Тогда
		СборноеНаименование = СборноеНаименование + " / " + Объект.ДСТ_Группа2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДСТ_Группа3) Тогда
		СборноеНаименование = СборноеНаименование + " / " + Объект.ДСТ_Группа3;
	КонецЕсли;
	
	Если СборноеНаименование <> "" Тогда
		СборноеНаименование = Сред(СборноеНаименование, 4);
	КонецЕсли;
	
	Объект.Наименование = СборноеНаименование;
	
КонецПроцедуры
